# Pandas(Python Data Analysis Library)
- Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.
- Using pandas we can replicate any SQL Query
- Data wrangling, sometimes referred to as data munging, is the process of transforming and mapping data from one "raw" data form into another format with the intent of making it more appropriate and valuable for a variety of downstream purposes such as analytics.

## 1.Load CSV files into DF

In [3]:
import os

print(os.getcwd())
os.chdir("E:/code/5.DataAnalysisOfficial/data/pandas")
print(os.getcwd())

E:\code\5.DataAnalysisOfficial
E:\code\5.DataAnalysisOfficial\data\pandas

In [4]:
import pandas as pd
df = pd.read_csv("pandas_sales.csv")
df

  month  eggs  salt  spam
0   Jan    47  12.0    17
1   Feb   110  50.0    31
2   Mar   221  89.0    72
3   Apr    77  87.0    20
4   May   132   NaN    52
5   Jun   205  60.0    55

In [5]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [6]:
df = pd.read_csv("pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [7]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

In [8]:
df.columns

Index(['eggs', 'salt', 'spam'], dtype='object')

In [9]:
df.size

18

In [10]:
df.memory_usage()   #in bytes

Index    48
eggs     48
salt     48
spam     48
dtype: int64

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Jan to Jun
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   eggs    6 non-null      int64
 1   salt    5 non-null      float64
 2   spam    6 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 192.0+ bytes

## 2. Reading DataFrame

In [13]:
import pandas as pd
df=pd.read_csv("pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### method1: Read DF  byindex -- [column][row]

In [14]:
#print 47
df["eggs"]["Jan"]

47

In [15]:
#print 52
df["spam"]["May"]

52

#### Note: df["Jan"]["eggs"]  --->   [row][column] is not possible

### method2:Read DF  by column label followed by row index

In [16]:
import pandas as pd
df=pd.read_csv("pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [17]:
df.columns

Index(['eggs', 'salt', 'spam'], dtype='object')

In [18]:
#df.salt
df['salt']

month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0
Name: salt, dtype: float64

In [19]:
#print 47
df.eggs[0]

47

In [20]:
#slice[]
#Here it returns the series
df.eggs[0:3]

month
Jan     47
Feb    110
Mar    221
Name: eggs, dtype: int64

In [21]:
#Fancy
#here also it returns Series
df.eggs[[1,3,5]]

month
Feb    110
Apr     77
Jun    205
Name: eggs, dtype: int64

In [22]:
a=df.eggs[[1,3,5]]
type(a)

pandas.core.series.Series

### method3:Read DF  by loc(Label)
- df.loc[row]   --> Series
- df.loc[[row]] --> DF
- df.loc['row1':'row2']  -->  DF
- df.loc[['row1','row2']]  --> DF

- df.loc[:,'col1']   # for col access rows are mandatory
- df.loc[:,'col1':'col2']       #slicing
- df.loc[:,['col1','col2']]     #fancy

- df.loc[row, column]
- df.loc['row1':'row4' , 'column1']
- df.loc['row1' , 'column1': 'column4']
- df.loc['row1':'row4' , 'column1': 'column4']

In [23]:
#df.loc?

#### Example1:

In [24]:
import pandas as pd
df=pd.read_csv("pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [25]:
df.loc['Jan','eggs']

47

In [26]:
df.loc["Jan":"Mar","salt"]      #slice

month
Jan    12.0
Feb    50.0
Mar    89.0
Name: salt, dtype: float64

In [27]:
df.loc["Jan":"Mar","eggs":"spam"]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72

In [28]:
df.loc[["Jan","Mar"],["eggs","spam"]] #fancy

       eggs  spam
month
Jan      47    17
Mar     221    72

#### Example2

In [29]:
td = [[1, 2,3], [4, 5,6], [7, 8,9],[11,12,13],[14,15,16],[17,18,19]]
td

[[1, 2, 3], [4, 5, 6], [7, 8, 9], [11, 12, 13], [14, 15, 16], [17, 18, 19]]

In [30]:
df = pd.DataFrame(data=td, 
                  index=['cobra', 'viper', 'sidewinder',"greenviper","russelviper",'blackmamba'],
                  columns=['max_speed', 'shield',"poisnous"])
df

             max_speed  shield  poisnous
cobra                1       2         3
viper                4       5         6
sidewinder           7       8         9
greenviper          11      12        13
russelviper         14      15        16
blackmamba          17      18        19

#### row wise operations

In [31]:
#Single label. Note: this returns the row as a Series.
#if we use single label it returns Series
s1 = df.loc["cobra"]            #by default it will takes only row if we provide the column then
s1                                      #KeyError:-'the label [max_speed] is not in the [index]'

max_speed    1
shield       2
poisnous     3
Name: cobra, dtype: int64

In [32]:
 #if we use list of label it returns DataFrame
df1=df.loc[["cobra"]] 
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

       max_speed  shield  poisnous
cobra          1       2         3

In [33]:
df.loc['viper':'russelviper']

             max_speed  shield  poisnous
viper                4       5         6
sidewinder           7       8         9
greenviper          11      12        13
russelviper         14      15        16

In [34]:
df.loc[['viper','cobra']]

       max_speed  shield  poisnous
viper          4       5         6
cobra          1       2         3

#### column wise

In [35]:
df.loc[:,'max_speed']        #column wise

cobra           1
viper           4
sidewinder      7
greenviper     11
russelviper    14
blackmamba     17
Name: max_speed, dtype: int64

In [36]:
df.loc[:,['max_speed']]

             max_speed
cobra                1
viper                4
sidewinder           7
greenviper          11
russelviper         14
blackmamba          17

In [37]:
df.loc[:,'max_speed':'poisnous']

             max_speed  shield  poisnous
cobra                1       2         3
viper                4       5         6
sidewinder           7       8         9
greenviper          11      12        13
russelviper         14      15        16
blackmamba          17      18        19

In [38]:
df.loc[:,['max_speed','poisnous']]

             max_speed  poisnous
cobra                1         3
viper                4         6
sidewinder           7         9
greenviper          11        13
russelviper         14        16
blackmamba          17        19

#### row and column operations

In [39]:
#print value 40                
df.loc["viper","max_speed"]      #df.loc["row","column"]

4

In [40]:
df.loc["cobra":"sidewinder","max_speed"]

cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [41]:
df.loc["cobra","max_speed":"shield"]

max_speed    1
shield       2
Name: cobra, dtype: int64

In [42]:
df.loc["cobra":"greenviper","max_speed":"poisnous"]

            max_speed  shield  poisnous
cobra               1       2         3
viper               4       5         6
sidewinder          7       8         9
greenviper         11      12        13

#### Boolean list with the same length as the row axis

In [43]:
df

             max_speed  shield  poisnous
cobra                1       2         3
viper                4       5         6
sidewinder           7       8         9
greenviper          11      12        13
russelviper         14      15        16
blackmamba          17      18        19

In [44]:
df.loc[[False, True, True,False,True,False]]     #rows

             max_speed  shield  poisnous
viper                4       5         6
sidewinder           7       8         9
russelviper         14      15        16

#### Conditional that returns a boolean Series

In [45]:
df.loc[df['shield'] > 8]

             max_speed  shield  poisnous
greenviper          11      12        13
russelviper         14      15        16
blackmamba          17      18        19

### Method 4: by using iloc (if possible use this)

In [46]:
#df.iloc?

In [47]:
import pandas as pd

my_dict = [{'a':1,'b':2,'c':3,'d':4},
          {'a':10,'b':20,'c':30,'d':40},
          {'a':100,'b':200,'c':300,'d':400}]

In [48]:
df = pd.DataFrame(my_dict)
df

     a    b    c    d
0    1    2    3    4
1   10   20   30   40
2  100  200  300  400

In [49]:
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [50]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [51]:
df.iloc[0:3]                  # slicing

     a    b    c    d
0    1    2    3    4
1   10   20   30   40
2  100  200  300  400

In [52]:
df.iloc[[0,1]]               # fancy

    a   b   c   d
0   1   2   3   4
1  10  20  30  40

#### column wise

In [53]:
df.iloc[:,1]

0      2
1     20
2    200
Name: b, dtype: int64

In [54]:
df.iloc[:,[1]]

     b
0    2
1   20
2  200

In [55]:
df.iloc[:,2:3]

     c
0    3
1   30
2  300

In [56]:
df.iloc[:,[2,3]]

     c    d
0    3    4
1   30   40
2  300  400

#### boolean

In [57]:
df

     a    b    c    d
0    1    2    3    4
1   10   20   30   40
2  100  200  300  400

In [58]:
df.iloc[[True, False, True]]    # rows

     a    b    c    d
0    1    2    3    4
2  100  200  300  400

In [59]:
df.iloc[lambda x: x.index%2 == 0]

     a    b    c    d
0    1    2    3    4
2  100  200  300  400

#### row and column

In [60]:
df.iloc[2,1]

200

In [61]:
df.iloc[0,:]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [62]:
df.iloc[[0,2],:]

     a    b    c    d
0    1    2    3    4
2  100  200  300  400

#### Note: diff between loc and iloc
- loc includes both starting  and ending values
- iloc includes starting index and excludes the ending index

## 3.Create Sub - DataFrame from another DF

In [63]:
#sql : create table sub_df as select eggs,salt from df
df = pd.read_csv("pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [64]:
# it occupies separate memory nothing deep copy
sub_df = df[["salt","eggs"]]
sub_df

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

## 4.Create Series(1 column+index) from DataFrame[]

In [65]:
s = pd.Series(data=[47,25,63,72,89,92],index=['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'],name="pavan")
s

Jan    47
Feb    25
Mar    63
Apr    72
May    89
Jun    92
Name: pavan, dtype: int64

In [66]:
Series_eggs = df["eggs"]
Series_eggs

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

## Understanding: ML needs input(X(set of columns)) & output(y(only one column))

#### Example1

In [67]:
import pandas as pd

df = pd.read_csv("pima-indians-diabetes.txt")
df.head()

,pregnancies,glucose,diastolic,triceps,insulin,bmi,dpf,age,diabetes
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [68]:
df.columns

Index(['pregnancies', 'glucose', 'diastolic', 'triceps', 'insulin', 'bmi',
       'dpf', 'age', 'diabetes'],
      dtype='object')

In [69]:
#X = df[["pregnancies","glucose","diastolic","triceps","insulin","bmi","dpf","age"]]  or     X = df.iloc[:,:-1].values 
X = df.loc[:,df.columns!="diabetes"]      #df.iloc[:,:-1]  or df.iloc[:,0:8]  or df.loc[:,"pregnancies":"age"] 
type(X)

pandas.core.frame.DataFrame

In [70]:
X = X.values
type(X)

numpy.ndarray

In [71]:
y=df["diabetes"]        #df.iloc[:,-1]  or df.iloc[:,8] or df.loc[:,"diabetes"] or 
type(y)

pandas.core.series.Series

In [72]:
y = y.values
type(y)

numpy.ndarray

In [73]:
y[:10]

array([1, 0, 1, 0, 1, 0, 1, 0, 1, 1], dtype=int64)

#### Example2

In [74]:
import pandas as pd

df = pd.read_csv("iris.csv")
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [75]:
X = df.loc[:,df.columns!="species"]           # X = df.iloc[:,:-1].values
X.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [76]:
type(X)

pandas.core.frame.DataFrame

In [77]:
y=df["species"]                                  # y=df.iloc[:,-1].values
y.head()

0    setosa
1    setosa
2    setosa
3    setosa
4    setosa
Name: species, dtype: object

In [78]:
type(y)

pandas.core.series.Series

In [79]:
y.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [80]:
#pd.DataFrame?

### Reference: https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html
- refer doc on loc
- refer doc on iloc